apemangr/Repetidor-nRF52-SDK-17.1.0/filesystem.c
#include "filesystem.h"
#include "variables.h"
#include "ble_gap.h"
#include "nrf_sdh_ble.h"
#include "app_nus_server.h"
#include <stdint.h>

// Buffer estático para evitar problemas con variables locales en el stack
static store_history g_temp_history_buffer;
extern void          app_nus_client_on_data_received(
                    const uint8_t *data_ptr,
                    uint16_t       data_length);
extern config_repeater_t config_repeater;

//-------------------------------------------------------------------------------------------------------------
//                                      FDS INIT FUNCTIONS STARTS HERE
//-------------------------------------------------------------------------------------------------------------

// Función para realizar la recolección de basura
static void perform_garbage_collection(void)
{
    ret_code_t err_code = fds_gc();
    if (err_code == NRF_SUCCESS) {
        NRF_LOG_RAW_INFO(LOG_OK " Recoleccion de basura completada.");
    }
    else {
        NRF_LOG_RAW_INFO(
                   LOG_FAIL " Error en la recoleccion de basura: %d",
                   err_code);
    }
}

static void fds_evt_handler(fds_evt_t const *p_evt)
{
    if (p_evt->id == FDS_EVT_INIT) {
        if (p_evt->result == NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(
                       LOG_EXEC " Iniciando el modulo de almacenamiento...");

            fds_stat_t stat = {0};
            fds_stat(&stat);
            NRF_LOG_RAW_INFO(
                       LOG_INFO " Se encontraron %d registros validos.",
                       stat.valid_records);
            NRF_LOG_RAW_INFO(
                       LOG_INFO " Se encontraron %d registros no validos.",
                       stat.dirty_records);

            if (stat.dirty_records > 0) {
                // Realiza la recolección de basura
                NRF_LOG_RAW_INFO(LOG_INFO " Limpiando registros no validos...");
                perform_garbage_collection();
            }
            NRF_LOG_RAW_INFO(LOG_OK " Modulo inicializado correctamente.");
        }
        else {
            NRF_LOG_RAW_INFO(
                       LOG_FAIL " nError al inicializar FDS: %d",
                       p_evt->result);
        }
    }
    else if (p_evt->id == FDS_EVT_WRITE) {
        if (p_evt->result == NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(LOG_OK " Registro escrito correctamente!\x1b[0m");
        }
        else {
            NRF_LOG_RAW_INFO(
                       LOG_FAIL "Error al escribir el registro: %d",
                       p_evt->result);
        }
    }
    else if (p_evt->id == FDS_EVT_UPDATE) {
        if (p_evt->result == NRF_SUCCESS) {
            // NRF_LOG_RAW_INFO(
            //     "\n\n\x1b[1;32m>>\x1b[0m Registro actualizado
            //     correctamente!");
        }
        else {
            NRF_LOG_ERROR("Error al actualizar el registro: %d", p_evt->result);
        }
    }
    else if (p_evt->id == FDS_EVT_DEL_RECORD) {
        if (p_evt->result == NRF_SUCCESS) {
            NRF_LOG_RAW_INFO("\nRegistro eliminado correctamente.");
        }
        else {
            NRF_LOG_ERROR("Error al eliminar el registro: %d", p_evt->result);
        }
    }
}

void fds_initialize(void)
{
    ret_code_t err_code;

    // Registra el manejador de eventos
    err_code = fds_register(fds_evt_handler);
    APP_ERROR_CHECK(err_code);

    // Inicializa el módulo FDS
    err_code = fds_init();
    APP_ERROR_CHECK(err_code);
}

//-------------------------------------------------------------------------------------------------------------
//                                      FDS INIT FUNCTIONS ENDS HERE
//-------------------------------------------------------------------------------------------------------------

ret_code_t save_history_record_emisor(
           store_history const *p_history_data,
           uint16_t             offset)
{
    ret_code_t        ret;
    fds_record_desc_t desc_history = {0};
    fds_record_desc_t desc_counter = {0};
    fds_find_token_t  token        = {0};

    memcpy(&g_temp_history_buffer, p_history_data, sizeof(store_history));
    adc_values.contador = g_temp_history_buffer.contador;
    adc_values.V1       = g_temp_history_buffer.V1;
    adc_values.V2       = g_temp_history_buffer.V2;

    // Preparar nuevo registro histórico
    uint16_t     record_key = HISTORY_RECORD_KEY_START + offset;
    fds_record_t new_record = {
               .file_id     = HISTORY_FILE_ID,
               .key         = record_key,
               .data.p_data = &g_temp_history_buffer, // Usar buffer estático
               .data.length_words = BYTES_TO_WORDS(sizeof(store_history))};

    // Buscar el registro del historial, si no existe lo escribe
    ret = fds_record_find(HISTORY_FILE_ID, record_key, &desc_history, &token);
    if (ret == NRF_SUCCESS) {
        // Si el registro ya existe, lo actualiza
        ret = fds_record_update(&desc_history, &new_record);
        if (ret != NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(
                       LOG_FAIL " Error al actualizar el registro: %d",
                       ret);
            return ret;
        }
        NRF_LOG_RAW_INFO(
                   LOG_INFO " Registro actualizado con KEY: 0x%04X",
                   record_key);

        // Esperar que FDS complete la operación + flush de GC si es necesario
        nrf_delay_ms(1000);
        (void)fds_gc(); // Forzar garbage collection si es necesario
    }
    else if (ret == FDS_ERR_NOT_FOUND) {
        // Si no existe, lo escribe
        ret = fds_record_write(&desc_history, &new_record);
        if (ret != NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(
                       LOG_FAIL " Error al escribir el registro: %d",
                       ret);
            return ret;
        }
        NRF_LOG_RAW_INFO(
                   LOG_INFO " Registro escrito con KEY: 0x%04X",
                   record_key);

        // Esperar que FDS complete la operación + flush de GC si es necesario
        nrf_delay_ms(1000);
        (void)fds_gc(); // Forzar garbage collection si es necesario
        
