apemangr/Repetidor-nRF52-SDK-17.1.0/filesystem.c
        // Incrementar contador de historiales en memoria
        // La configuración se guardará cuando el dispositivo entre en modo sleep
        config_repeater.cantidad_historiales++;
        NRF_LOG_RAW_INFO(LOG_INFO " Contador de historiales: %u", 
                       config_repeater.cantidad_historiales);
    }
    else {
        NRF_LOG_RAW_INFO(LOG_FAIL " Error al buscar el registro: %d", ret);
        return ret;
    }

    return NRF_SUCCESS;
}

ret_code_t save_adv_history_record(const store_adv_history *p_adv_history, 
                                    uint32_t contador)
{
    ret_code_t        ret;
    fds_record_desc_t desc        = {0};
    fds_find_token_t  token       = {0};
    
    // Calcular el offset basado en el contador (cada 142 contadores = 1 historial)
    uint16_t history_number = (uint16_t)(contador / 142);
    uint16_t record_key = ADV_HISTORY_RECORD_KEY + history_number;
    
    NRF_LOG_RAW_INFO(LOG_INFO " Guardando historial ADV #%u (contador=%u, record_key=0x%04X)",
                   history_number, contador, record_key);
    
    // Preparar registro para FDS
    fds_record_t new_record = {
        .file_id           = ADV_HISTORY_FILE_ID,
        .key               = record_key,
        .data.p_data       = p_adv_history,
        .data.length_words = BYTES_TO_WORDS(sizeof(store_adv_history))
    };
    
    // Buscar si ya existe el registro
    ret = fds_record_find(ADV_HISTORY_FILE_ID, record_key, &desc, &token);
    
    if (ret == NRF_SUCCESS) {
        // Si existe, actualizar
        ret = fds_record_update(&desc, &new_record);
        if (ret != NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(LOG_FAIL " Error al actualizar historial ADV: %d", ret);
            return ret;
        }
        NRF_LOG_RAW_INFO(LOG_OK " Historial ADV #%u actualizado", history_number);
    }
    else if (ret == FDS_ERR_NOT_FOUND) {
        // Si no existe, crear nuevo
        ret = fds_record_write(&desc, &new_record);
        if (ret != NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(LOG_FAIL " Error al escribir historial ADV: %d", ret);
            return ret;
        }
        NRF_LOG_RAW_INFO(LOG_OK " Historial ADV #%u creado", history_number);
    }
    else {
        NRF_LOG_RAW_INFO(LOG_FAIL " Error al buscar historial ADV: %d", ret);
        return ret;
    }
    
    // Dar tiempo para que FDS complete la operación
    nrf_delay_ms(50);
    
    return NRF_SUCCESS;
}

ret_code_t update_history_counter(uint32_t new_count)
{
    fds_record_desc_t desc_counter = {0};
    fds_find_token_t  token        = {0};
    ret_code_t        ret;

    // Buscar el registro del contador
    ret = fds_record_find(
               HISTORY_FILE_ID,
               HISTORY_COUNTER_RECORD_KEY,
               &desc_counter,
               &token);

    nrf_delay_ms(500);
    fds_record_t counter_record = {
               .file_id           = HISTORY_FILE_ID,
               .key               = HISTORY_COUNTER_RECORD_KEY,
               .data.p_data       = &new_count,
               .data.length_words = 1};

    if (ret == NRF_SUCCESS) {
        // Actualizar el registro existente
        ret = fds_record_update(&desc_counter, &counter_record);
        nrf_delay_ms(500); // Delay tras actualizar
        if (ret == NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(
                       LOG_INFO " Contador actualizado correctamente a: %lu",
                       new_count);
        }
    }
    else if (ret == FDS_ERR_NOT_FOUND) {
        // Si no existe, escribir el valor inicial (0) en memoria
        uint32_t initial_value     = 1;
        counter_record.data.p_data = &initial_value;
        ret                        = fds_record_write(NULL, &counter_record);
        nrf_delay_ms(500); // Delay tras escribir
        if (ret == NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(LOG_OK " Contador creado en memoria con valor 1.");
        }
        else {
            NRF_LOG_RAW_INFO(LOG_FAIL " Error al crear el contador: %d", ret);
        }
    }
    else {
        NRF_LOG_RAW_INFO(
                   LOG_FAIL " Error al buscar el registro del contador: %d",
                   ret);
    }

    return ret;
}

//-------------------------------------------------------------------------------------------------------------
//                                      HISTORY FUNCTIONS STARTS HERE.
//-------------------------------------------------------------------------------------------------------------

ret_code_t read_history_record_by_id(
           uint16_t       record_id,
           store_history *p_history_data)
{
    fds_record_desc_t desc  = {0};
    fds_find_token_t  token = {0};

    // La clave del registro se calcula sumando el ID a la clave base.
    uint16_t record_key = (uint16_t)(HISTORY_RECORD_KEY_START + record_id);

    NRF_LOG_RAW_INFO(
               "\nLeyendo registro de historial con \x1B[33mID:\x1B[0m %u "
               "y \x1B[33mRECORD_KEY:\x1B[0m 0x%04X",
               record_id,
               record_key);

    if (fds_record_find(HISTORY_FILE_ID, record_key, &desc, &token) ==
        NRF_SUCCESS) {
        nrf_delay_ms(100);
        fds_flash_record_t flash_record = {0};
        ret_code_t         ret          = fds_record_open(&desc, &flash_record);
        if (ret != NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(
                       LOG_FAIL " Error al abrir el registro de historial");
            nrf_delay_ms(100);
            return ret;
        }

        // Verificar que el tamaño del registro en flash coincida con el del
        // struct.
        if (flash_record.p_header->length_words !=
            BYTES_TO_WORDS(sizeof(store_history))) {
            NRF_LOG_RAW_INFO(
                       LOG_WARN
                       " Tamano del registro en flash no coincide con el "
                       "esperado.");
            fds_record_close(&desc);
            nrf_delay_ms(10);
            return NRF_ERROR_INVALID_DATA;
        }

        // Copiar los datos al puntero de salida.
        memcpy(p_history_data, flash_record.p_data, sizeof(store_history));

        return fds_record_close(&desc);
    }

    return NRF_ERROR_NOT_FOUND;
}

ret_code_t read_last_history_record(store_history *p_history_data)
{
    fds_record_desc_t desc  = {0};
    fds_find_token_t  token = {0};

    // 1. Buscar el contador para saber cuál es el último registro.
    if (fds_record_find(
                   HISTORY_FILE_ID,
                   (uint16_t)HISTORY_COUNTER_RECORD_KEY,
                   &desc,
                   &token) == NRF_SUCCESS) {
        fds_flash_record_t flash_record  = {0};
        uint32_t           history_count = 0; // Correcto: uint32_t

