apemangr/Repetidor-nRF52-SDK-17.1.0/filesystem.c
        fds_record_open(&desc, &flash_record);
        memcpy(&history_count,
               flash_record.p_data,
               sizeof(uint32_t)); // Leer 4 bytes, no 2
        fds_record_close(&desc);

        if (history_count == 0) {
            return NRF_ERROR_NOT_FOUND; // No hay registros guardados.
        }

        // 2. El ID del último registro es (contador - 1).
        uint32_t last_record_id = history_count - 1;
        return read_history_record_by_id(
                   (uint16_t)last_record_id,
                   p_history_data);
    }

    // Si el contador no se encuentra, significa que no hay registros.
    return NRF_ERROR_NOT_FOUND;
}

void print_history_record(store_history const *p_record, const char *p_title)
{
    // Calcula el largo de la línea de cierre según el título
    NRF_LOG_RAW_INFO(
               "\n\n\x1B[1;36m=======\x1B[0m %s \x1B[1;36m=======\x1B[0m\n\n",
               p_title);
    NRF_LOG_RAW_INFO(
               "Fecha        : %02d/%02d/%04d\n",
               p_record->day,
               p_record->month,
               p_record->year);
    NRF_LOG_RAW_INFO(
               "Hora         : %02d:%02d:%02d\n",
               p_record->hour,
               p_record->minute,
               p_record->second);
    NRF_LOG_RAW_INFO("Contador     : %lu\n", p_record->contador);
    NRF_LOG_RAW_INFO("V1           : %u\n", p_record->V1);
    NRF_LOG_RAW_INFO("V2           : %u\n", p_record->V2);
    NRF_LOG_RAW_INFO("V3           : %u\n", p_record->V3);
    NRF_LOG_RAW_INFO("V4           : %u\n", p_record->V4);
    NRF_LOG_RAW_INFO("V5           : %u\n", p_record->V5);
    NRF_LOG_RAW_INFO("V6           : %u\n", p_record->V6);
    NRF_LOG_RAW_INFO("V7           : %u\n", p_record->V7);
    NRF_LOG_RAW_INFO("V8           : %u\n", p_record->V8);
    NRF_LOG_RAW_INFO("Temp         : %u\n", p_record->temp);
    NRF_LOG_RAW_INFO("Bateria      : %u%%\n", p_record->battery);
    NRF_LOG_RAW_INFO(
               "\n\x1B[1;36m================\x1B[0m FIN "
               "\x1B[1;36m================\x1B[0m\n");
    NRF_LOG_FLUSH();
}


void print_adv_history_record(const store_adv_history *p_record, const char *p_title)
{
    NRF_LOG_RAW_INFO(
               "\n\n\x1B[1;36m=======\x1B[0m %s \x1B[1;36m=======\x1B[0m\n\n",
               p_title);
    NRF_LOG_RAW_INFO(
               "Fecha        : %02d/%02d/%04d\n",
               p_record->day,
               p_record->month,
               p_record->year);
    NRF_LOG_RAW_INFO(
               "Hora         : %02d:%02d:%02d\n",
               p_record->hour,
               p_record->minute,
               p_record->second);
    NRF_LOG_RAW_INFO("Contador ADV : %lu\n", p_record->contador);
    NRF_LOG_RAW_INFO("V1 (ADC1)    : %u\n", p_record->V1);
    NRF_LOG_RAW_INFO("V2 (ADC2)    : %u\n", p_record->V2);
    NRF_LOG_RAW_INFO(
               "\n\x1B[1;36m================\x1B[0m FIN "
               "\x1B[1;36m================\x1B[0m\n");
    NRF_LOG_FLUSH();
}

//-------------------------------------------------------------------------------------------------------------
//                                      HISTORY FUNCTIONS ENDS HERE.
//-------------------------------------------------------------------------------------------------------------

uint32_t read_time_from_flash(valor_type_t valor_type, uint32_t default_valor)
{
    fds_flash_record_t flash_record;
    fds_record_desc_t  record_desc;
    fds_find_token_t   ftok      = {0}; // Importante inicializar a cero
    uint32_t           resultado = default_valor;
    uint32_t          *data;
    ret_code_t         err_code;
    const char        *label;
    uint16_t           record_key;

    switch (valor_type) {
    case TIEMPO_ENCENDIDO:
        record_key = TIME_ON_RECORD_KEY;
        label      = "encendido";
        break;
    case TIEMPO_SLEEP:
        record_key = TIME_SLEEP_RECORD_KEY;
        label      = "sleep";
        break;
    case TIEMPO_EXTENDED_SLEEP:
        record_key = TIME_EXTENDED_SLEEP_RECORD_KEY;
        label      = "sleep extendido";
        break;
    case TIEMPO_EXTENDED_ENCENDIDO:
        record_key = TIME_EXTENDED_ON_RECORD_KEY;
        label      = "encendido extendido";
        break;
    default:
        record_key = TIME_ON_RECORD_KEY;
        label      = "desconocido";
        break;
    }

    // Busca el registro en la memoria flash
    err_code = fds_record_find(TIME_FILE_ID, record_key, &record_desc, &ftok);

    if (err_code == NRF_SUCCESS) {
        // Si el registro existe, abre y lee el valor
        err_code = fds_record_open(&record_desc, &flash_record);
        if (err_code == NRF_SUCCESS) {
            // Verifica que el tamaño del dato leído sea el esperado
            if (flash_record.p_header->length_words == 1) {
                // Copiar directamente el valor desde flash
                data      = (uint32_t *)flash_record.p_data;
                resultado = *data;
                // NRF_LOG_RAW_INFO(LOG_INFO " Tiempo de %s cargado: %u
                // segundos", label, resultado/1000);
            }
            else {
                NRF_LOG_RAW_INFO(
                           "\n\t>> Tamaño del dato en memoria flash no "
                           "coincide con "
                           "el "
                           "esperado.\n");
            }

            err_code = fds_record_close(&record_desc);
            if (err_code != NRF_SUCCESS) {
                NRF_LOG_RAW_INFO(
                           "\n\t>> Error al cerrar el registro: 0x%X",
                           err_code);
                return default_valor;
            }
        }
        else {
            NRF_LOG_RAW_INFO(
                       "\n\t>> Error al abrir el registro: 0x%X",
                       err_code);
        }
    }
    else {
        // NRF_LOG_RAW_INFO(
        //     "\n\t>> Registro no encontrado. Usando valor predeterminado: %u",
        //     default_valor);
    }

    return resultado;
}

datetime_t read_date_from_flash(void)
{
    const uint16_t     len = sizeof(datetime_t);
    fds_flash_record_t flash_record;
    fds_record_desc_t  record_desc;
    fds_find_token_t   ftok = {0};
    ret_code_t         err_code;

