apemangr/Repetidor-nRF52-SDK-17.1.0/filesystem.c
    datetime_t         resultado = {
                       .year   = 3000,
                       .month  = 5,
                       .day    = 30,
                       .hour   = 0,
                       .minute = 0,
                       .second = 0};

    err_code = fds_record_find(
               DATE_AND_TIME_FILE_ID,
               DATE_AND_TIME_RECORD_KEY,
               &record_desc,
               &ftok);

    if (err_code != NRF_SUCCESS) {
        NRF_LOG_RAW_INFO(
                   "\n\t>> Registro no encontrado (0x%X). Usando "
                   "predeterminado.",
                   err_code);
        return resultado;
    }

    err_code = fds_record_open(&record_desc, &flash_record);
    if (err_code != NRF_SUCCESS) {
        NRF_LOG_RAW_INFO("\n\t>> Error al abrir registro: 0x%X", err_code);
        return resultado;
    }

    // Verificar tamaño en BYTES (no palabras)
    const uint32_t data_size_bytes =
               flash_record.p_header->length_words * sizeof(uint32_t);

    if (data_size_bytes >= len) {
        memcpy(&resultado, flash_record.p_data, len);
    }
    else {
        NRF_LOG_RAW_INFO(
                   "\n\t>> Dato corrupto: tamaño %u < %u",
                   data_size_bytes,
                   len);
    }

    // Cerrar usando DESCRIPTOR (no flash_record)
    err_code = fds_record_close(&record_desc);
    if (err_code != NRF_SUCCESS) {
        NRF_LOG_RAW_INFO("\n\t>> Error al cerrar registro: 0x%X", err_code);
    }

    return resultado;
}

//-------------------------------------------------------------------------------------------------------------
//                                      HISTORY FUNCTIONS ENDS HERE.
//-------------------------------------------------------------------------------------------------------------

void write_time_to_flash(valor_type_t valor_type, uint32_t valor)
{
    uint16_t    record_key;
    const char *label;

    switch (valor_type) {
    case TIEMPO_ENCENDIDO:
        record_key = TIME_ON_RECORD_KEY;
        label      = "encendido";
        break;
    case TIEMPO_SLEEP:
        record_key = TIME_SLEEP_RECORD_KEY;
        label      = "sleep";
        break;
    case TIEMPO_EXTENDED_SLEEP:
        record_key = TIME_EXTENDED_SLEEP_RECORD_KEY;
        label      = "sleep extendido";
        break;
    case TIEMPO_EXTENDED_ENCENDIDO:
        record_key = TIME_EXTENDED_ON_RECORD_KEY;
        label      = "encendido extendido";
        break;
    default:
        record_key = TIME_ON_RECORD_KEY;
        label      = "desconocido";
        break;
    }

    fds_record_t record = {
               .file_id           = TIME_FILE_ID,
               .key               = record_key,
               .data.p_data       = &valor,
               .data.length_words = 1};
    fds_record_desc_t record_desc;
    fds_find_token_t  ftok = {0};
    ret_code_t        err_code =
               fds_record_find(TIME_FILE_ID, record_key, &record_desc, &ftok);

    if (err_code == NRF_SUCCESS) {
        err_code = fds_record_update(&record_desc, &record);
        NRF_LOG_RAW_INFO(
                   LOG_INFO " Tiempo de %s %s: %d segundos.",
                   label,
                   (err_code == NRF_SUCCESS) ? "actualizado"
                                             : "falló al actualizar",
                   valor / 1000);
    }
    else if (err_code == FDS_ERR_NOT_FOUND) {
        err_code = fds_record_write(&record_desc, &record);
        NRF_LOG_RAW_INFO(
                   LOG_OK " Tiempo de %s %s: %d segundos.",
                   label,
                   (err_code == NRF_SUCCESS) ? "guardado" : "falló al guardar",
                   valor / 1000);
    }
    else {
        NRF_LOG_ERROR(
                   "Error al buscar el registro en memoria flash: %d",
                   err_code);
    }
}

ret_code_t write_date_to_flash(const datetime_t *p_date)
{
    ret_code_t        err_code;
    fds_record_desc_t record_desc;
    fds_find_token_t  ftok   = {0};

    fds_record_t      record = {
                    .file_id = DATE_AND_TIME_FILE_ID,
                    .key     = DATE_AND_TIME_RECORD_KEY,
                    .data    = {.p_data       = p_date,
                                .length_words = (sizeof(datetime_t) + 3) /
                                                sizeof(uint32_t)}};

    err_code = fds_record_find(
               DATE_AND_TIME_FILE_ID,
               DATE_AND_TIME_RECORD_KEY,
               &record_desc,
               &ftok);

    if (err_code == NRF_SUCCESS) {
        err_code = fds_record_update(&record_desc, &record);
        if (err_code == NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(LOG_OK " Fecha y hora actualizada correctamente");
        }
        else {
            NRF_LOG_RAW_INFO(
                       LOG_FAIL " Error actualizando fecha y hora: 0x%X",
                       err_code);
        }
    }
    else if (err_code == FDS_ERR_NOT_FOUND) {
        err_code = fds_record_write(NULL, &record);
        if (err_code == NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(LOG_OK " Fecha y hora guardada correctamente");
        }
        else {
            NRF_LOG_RAW_INFO(
                       LOG_FAIL " Error escribiendo fecha y hora: 0x%X",
                       err_code);
        }
    }
    else {
        NRF_LOG_RAW_INFO(LOG_FAIL " Error buscando: 0x%X", err_code);
    }

    return err_code;
}

void load_mac_from_flash(mac_type_t mac_type, uint8_t *mac_out)
{
    fds_record_desc_t  record_desc;
    fds_find_token_t   ftok = {0};
    fds_flash_record_t flash_record;
    uint16_t           record_key;
    const char        *mac_label;

    // Determinar la clave de registro y etiqueta según el tipo de MAC
    switch (mac_type) {
    case MAC_EMISOR:
        record_key = MAC_EMISOR_RECORD_KEY;
        mac_label  = "MAC del emisor";
        break;
    case MAC_REPETIDOR:
        record_key = MAC_REPETIDOR_RECORD_KEY;
        mac_label  = "MAC del repetidor";
        break;
    default:
        record_key = MAC_EMISOR_RECORD_KEY;
        mac_label  = "MAC desconocida";
        break;
    }

    // Busca el registro en la memoria flash
    ret_code_t err_code;
    err_code = fds_record_find(MAC_FILE_ID, record_key, &record_desc, &ftok);
    if (err_code == NRF_SUCCESS) {
        err_code = fds_record_open(&record_desc, &flash_record);
        if (err_code == NRF_SUCCESS &&
            flash_record.p_header->length_words * 4 >= 6) {
            // Verifica que el tamaño del dato sea correcto
            if (flash_record.p_header->length_words != 2) {
                NRF_LOG_RAW_INFO(
                           "\n\t>> Tamaño de MAC en memoria flash no coincide "
                           "con "
                           "el esperado.");
                fds_record_close(&record_desc);
                return;
            }

            // Copia la MAC al buffer de salida
            memcpy(mac_out, flash_record.p_data, sizeof(uint8_t) * 6);
            fds_record_close(&record_desc);
            NRF_LOG_RAW_INFO(LOG_OK " %s cargada desde memoria: ", mac_label);
            NRF_LOG_RAW_INFO(
                       "%02X:%02X:%02X:%02X:%02X:%02X",

                       mac_out[0],
                       mac_out[1],
                       mac_out[2],
                       mac_out[3],
                       mac_out[4],
                       mac_out[5]);
        }
        else {
            memcpy(mac_out, flash_record.p_data, sizeof(mac_out));
            fds_record_close(&record_desc);
            NRF_LOG_RAW_INFO(LOG_OK " %s cargada desde memoria: ", mac_label);
            NRF_LOG_RAW_INFO(
                       "%02X:%02X:%02X:%02X:%02X:%02X",

                       mac_out[0],
                       mac_out[1],
                       mac_out[2],
                       mac_out[3],
                       mac_out[4],
                       mac_out[5]);
        }
    }
    else {
        NRF_LOG_RAW_INFO(
                   LOG_WARN " No se encontro %s. Usando valor "
                            "predeterminado.",
                   mac_label);

