apemangr/Repetidor-nRF52-SDK-17.1.0/filesystem.c
        // Valores predeterminados según el tipo de MAC
        if (mac_type == MAC_EMISOR) {
            // MAC predeterminada del emisor
            // Cargar MAC desde la config del repetidor
            mac_out[0] = config_repeater.mac_emisor[0];
            mac_out[1] = config_repeater.mac_emisor[1];
            mac_out[2] = config_repeater.mac_emisor[2];
            mac_out[3] = config_repeater.mac_emisor[3];
            mac_out[4] = config_repeater.mac_emisor[4];
            mac_out[5] = config_repeater.mac_emisor[5];
        }
        else // MAC_REPETIDOR
        {
            // MAC predeterminada del repetidor
            mac_out[0] = config_repeater.mac_repetidor[0];
            mac_out[1] = config_repeater.mac_repetidor[1];
            mac_out[2] = config_repeater.mac_repetidor[2];
            mac_out[3] = config_repeater.mac_repetidor[3];
            mac_out[4] = config_repeater.mac_repetidor[4];
            mac_out[5] = config_repeater.mac_repetidor[5];
        }

        NRF_LOG_RAW_INFO(LOG_INFO " %s cargada (predeterminada): ", mac_label);
        NRF_LOG_RAW_INFO(
                   "%02X:%02X:%02X:%02X:%02X:%02X",
                   mac_out[0],
                   mac_out[1],
                   mac_out[2],
                   mac_out[3],
                   mac_out[4],
                   mac_out[5]);
    }
}

void save_mac_to_flash(mac_type_t mac_type, uint8_t *mac_addr)
{
    fds_record_t      record;
    fds_record_desc_t record_desc;
    fds_find_token_t  ftok = {0};
    uint32_t          aligned_data_buffer[2]; // 2 * 4 = 8 bytes
    ret_code_t        ret;
    uint16_t          record_key;
    const char       *mac_label;

    // Determinar la clave de registro y etiqueta según el tipo de MAC
    switch (mac_type) {
    case MAC_EMISOR:
        record_key = MAC_EMISOR_RECORD_KEY;
        mac_label  = "MAC del emisor";
        break;
    case MAC_REPETIDOR:
        record_key = MAC_REPETIDOR_RECORD_KEY;
        mac_label  = "MAC del repetidor";
        break;
    default:
        record_key = MAC_EMISOR_RECORD_KEY;
        mac_label  = "MAC desconocida";
        break;
    }

    memcpy(aligned_data_buffer, mac_addr, 6);

    // Configura el registro con la MAC
    record.file_id     = MAC_FILE_ID;
    record.key         = record_key;
    record.data.p_data = aligned_data_buffer; // Apunta al buffer alineado

    record.data.length_words =
               (6 + sizeof(uint32_t) - 1) / sizeof(uint32_t); // (6 + 3) / 4 = 2

    // Realiza la recolección de basura si es necesario
    // perform_garbage_collection();

    ret = fds_record_find(MAC_FILE_ID, record_key, &record_desc, &ftok);
    // Si ya existe un registro, actualízalo
    if (ret == NRF_SUCCESS) {
        if (fds_record_update(&record_desc, &record) == NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(
                       LOG_INFO " Actualizando %s en memoria flash.",
                       mac_label);
            // NVIC_SystemReset();  // Reinicia el dispositivo
        }
        else {
            NRF_LOG_RAW_INFO(
                       LOG_FAIL " Error al actualizar %s en memoria flash.",
                       mac_label);
        }
    }
    else {
        // Si no existe, crea un nuevo registro
        ret = fds_record_write(&record_desc, &record);

        if (ret == NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(
                       LOG_OK " %s guardada correctamente en memoria.",
                       mac_label);
        }
        else {
            NRF_LOG_RAW_INFO(
                       LOG_FAIL " Error al crear el registro de %s: %d",
                       mac_label,
                       ret);
        }
    }
}

// Variables globales para el envío asíncrono de historial (similar a cmd15)
static bool     history_send_active    = false;
static uint32_t history_current_record = 0;
static uint32_t history_total_records  = 0;
static uint32_t history_sent_count     = 0;
static uint32_t history_failed_count   = 0;

// Buffer para almacenar los record keys válidos encontrados por
// fds_record_iterate
#define MAX_HISTORY_RECORDS 248
static uint16_t history_valid_keys[MAX_HISTORY_RECORDS];
static uint16_t history_valid_count = 0;


static ret_code_t read_history_record_by_key(
           uint16_t       record_key,
           store_history *p_history_data)
{
    fds_record_desc_t desc  = {0};
    fds_find_token_t  token = {0};

    NRF_LOG_DEBUG("Leyendo registro con RECORD_KEY: 0x%04X", record_key);

    if (fds_record_find(HISTORY_FILE_ID, record_key, &desc, &token) ==
        NRF_SUCCESS) {
        fds_flash_record_t flash_record = {0};
        ret_code_t         ret          = fds_record_open(&desc, &flash_record);
        if (ret != NRF_SUCCESS) {
            NRF_LOG_ERROR("Error al abrir el registro");
            return ret;
        }

        // Verificar que el tamaño del registro sea correcto
        if (flash_record.p_header->length_words !=
            BYTES_TO_WORDS(sizeof(store_history))) {
            NRF_LOG_ERROR("Tamaño del registro no coincide");
            fds_record_close(&desc);
            return NRF_ERROR_INVALID_DATA;
        }

        // Copiar los datos al puntero de salida
        memcpy(p_history_data, flash_record.p_data, sizeof(store_history));

        return fds_record_close(&desc);
    }

    return NRF_ERROR_NOT_FOUND;
}

// Función auxiliar para enviar el siguiente paquete de historial (similar a
// cmd15_send_next_packet)
void history_send_next_packet(void)
{
    if (!history_send_active ||
        history_current_record >= history_total_records) {
        return;
    }

    uint32_t       packets_sent_this_round = 0;
    const uint32_t MAX_PACKETS_PER_ROUND = 5; // Enviar hasta 5 paquetes por vez

    while (history_send_active &&
           history_current_record < history_total_records &&
           packets_sent_this_round < MAX_PACKETS_PER_ROUND) {
        // Verificar que tengamos un índice válido
        if (history_current_record >= history_valid_count) {
            NRF_LOG_RAW_INFO(
                       LOG_WARN " Indice fuera de rango: %d >= %d",
                       history_current_record,
                       history_valid_count);
            history_send_active = false;
            break;
        }

        // Obtener el record key del registro actual
        uint16_t current_key = history_valid_keys[history_current_record];

        // Leer el registro actual directamente desde flash usando el record key
        store_history current_record;
        ret_code_t    read_result =
                   read_history_record_by_key(current_key, &current_record);

        if (read_result != NRF_SUCCESS) {
            // Si no se puede leer el registro, pasar al siguiente
            NRF_LOG_RAW_INFO(
                       LOG_FAIL " No se pudo leer registro key 0x%04X: 0x%X",
                       current_key,
                       read_result);
            history_current_record++;
            history_failed_count++;
            continue;
        }

        // Estructurar los datos en array BLE
        static uint8_t data_array[244];
        uint16_t       position = 0;

        // Byte 0: Magic
        data_array[position++] = 0x08;

