apemangr/Repetidor-nRF52-SDK-17.1.0/filesystem.c
        // Bytes 1-7: Fecha y hora
        data_array[position++] = current_record.day;
        data_array[position++] = current_record.month;
        data_array[position++] = (current_record.year >> 8) & 0xFF;
        data_array[position++] = (current_record.year & 0xFF);
        data_array[position++] = current_record.hour;
        data_array[position++] = current_record.minute;
        data_array[position++] = current_record.second;

        // Bytes 8-11: Contador (4 bytes) - convertir a big-endian
        data_array[position++] = (current_record.contador >> 24) & 0xFF;
        data_array[position++] = (current_record.contador >> 16) & 0xFF;
        data_array[position++] = (current_record.contador >> 8) & 0xFF;
        data_array[position++] = (current_record.contador & 0xFF);

        // Bytes 12-15: V1, V2 (2 bytes cada uno) - convertir a big-endian
        data_array[position++] = (current_record.V1 >> 8) & 0xFF;
        data_array[position++] = (current_record.V1 & 0xFF);
        data_array[position++] = (current_record.V2 >> 8) & 0xFF;
        data_array[position++] = (current_record.V2 & 0xFF);

        // Byte 16: Battery
        data_array[position++] = current_record.battery;

        // Bytes 17-28: MACs (rellenar con ceros)
        for (int j = 0; j < 12; j++) {
            data_array[position++] = 0x00;
        }

        // Bytes 29-40: V3-V8 (2 bytes cada uno) - convertir a big-endian
        data_array[position++] = (current_record.V3 >> 8) & 0xFF;
        data_array[position++] = (current_record.V3 & 0xFF);
        data_array[position++] = (current_record.V4 >> 8) & 0xFF;
        data_array[position++] = (current_record.V4 & 0xFF);
        data_array[position++] = (current_record.V5 >> 8) & 0xFF;
        data_array[position++] = (current_record.V5 & 0xFF);
        data_array[position++] = (current_record.V6 >> 8) & 0xFF;
        data_array[position++] = (current_record.V6 & 0xFF);
        data_array[position++] = (current_record.V7 >> 8) & 0xFF;
        data_array[position++] = (current_record.V7 & 0xFF);
        data_array[position++] = (current_record.V8 >> 8) & 0xFF;
        data_array[position++] = (current_record.V8 & 0xFF);

        // Byte 41: Temperatura
        data_array[position++] = current_record.temp;

        // Byte 42-43: last_position
        data_array[position++] = 0x11;
        data_array[position++] = 0x22;

        // Intentar enviar el paquete
        ret_code_t ret = app_nus_server_send_data(data_array, position);

        if (ret == NRF_SUCCESS) {
            history_current_record++;
            history_sent_count++;
            packets_sent_this_round++;

            // Mostrar progreso cada 10 registros
            if (history_sent_count % 10 == 0) {
                NRF_LOG_RAW_INFO(
                           "\nHistorial: %d/%d enviados",
                           history_sent_count,
                           history_total_records);
            }
        }
        else if (ret == NRF_ERROR_RESOURCES || ret == NRF_ERROR_BUSY) {
            // Buffer lleno - esperar al próximo TX_RDY
            break;
        }
        else {
            // Error real - detener el envío
            history_failed_count++;
            NRF_LOG_RAW_INFO(
                       "\nError enviando registro %d: 0x%X - Deteniendo envío",
                       history_current_record + 1,
                       ret);
            history_send_active = false;
            break;
        }
    }

    // Verificar finalización
    if (history_send_active &&
        history_current_record >= history_total_records) {
        history_send_active = false;
        NRF_LOG_RAW_INFO("\n=== ENVIO DE HISTORIAL COMPLETADO ===");
        NRF_LOG_RAW_INFO(
                   "\nRegistros enviados: %d/%d, Fallos: %d",
                   history_sent_count,
                   history_total_records,
                   history_failed_count);
        if (history_total_records > 0) {
            NRF_LOG_RAW_INFO(
                       "\nTasa exito: %d%%\n",
                       (history_sent_count * 100) / history_total_records);
        }
    }
}

ret_code_t send_all_history(void)
{
    ret_code_t    err_code;
    store_history history_record = {0};
    uint16_t      valid_records  = 0;

    NRF_LOG_RAW_INFO(
               "\n\n" LOG_EXEC
               "--- INICIANDO ENVIO DE HISTORIAL ASINCRONO ---");

    // Verificar si ya hay un envío activo
    if (history_send_active) {
        NRF_LOG_RAW_INFO(
                   LOG_INFO
                   " Envio de historial ya esta activo - ignorando nueva "
                   "solicitud");
        return NRF_ERROR_BUSY;
    }

    // Verificar estado inicial enviando un pequeño paquete de prueba
    uint8_t test_data[] = {0x08, 0x00}; // Magic + test byte
    err_code            = app_nus_server_send_data(test_data, 2);
    if (err_code != NRF_SUCCESS) {
        NRF_LOG_RAW_INFO(
                   LOG_WARN " No se puede enviar por BLE (0x%X). Verifica "
                            "conexion.",
                   err_code);
        if (err_code == NRF_ERROR_INVALID_STATE) {
            NRF_LOG_RAW_INFO(
                       LOG_WARN
                       " Asegurate de que hay un dispositivo conectado");
            NRF_LOG_RAW_INFO(
                       LOG_WARN
                       " Verifica que las notificaciones esten habilitadas");
        }
        return err_code;
    }
    nrf_delay_ms(100);

    NRF_LOG_RAW_INFO(
               LOG_EXEC " --- FASE 1: Contando registros validos en flash ---");

    // FASE 1: Contar y almacenar los record keys de registros válidos usando
    // fds_record_iterate
    fds_find_token_t   token          = {0};
    fds_record_desc_t  record_desc    = {0};
    fds_flash_record_t flash_record   = {0};
    uint16_t           expected_words = BYTES_TO_WORDS(sizeof(store_history));

    // Resetear contador y array de keys válidos
    history_valid_count = 0;

    // Iterar a través de todos los registros del HISTORY_FILE_ID
    while (fds_record_iterate(&record_desc, &token) == NRF_SUCCESS &&
           history_valid_count < MAX_HISTORY_RECORDS) {
        // Abrir el registro para acceder a su header
        err_code = fds_record_open(&record_desc, &flash_record);
        if (err_code != NRF_SUCCESS) {
            continue;
        }

        // Verificar que sea un registro de historial
        if (flash_record.p_header->file_id != HISTORY_FILE_ID) {
            fds_record_close(&record_desc);
            continue;
        }

        // Verificar que no sea el registro del contador
        if (flash_record.p_header->record_key == HISTORY_COUNTER_RECORD_KEY) {
            fds_record_close(&record_desc);
            continue;
        }

        // Verificar que el tamaño sea correcto
        if (flash_record.p_header->length_words ==
            expected_words) { // Inicializado a 0
            // Almacenar el record key válido
            history_valid_keys[history_valid_count] =
                       flash_record.p_header->record_key;
            history_valid_count++;
            valid_records++;

            if (valid_records % 10 == 0) {
                NRF_LOG_RAW_INFO(
                           LOG_INFO " Contados %d registros...",
                           valid_records);
            }
        }

        // Cerrar el registro
        fds_record_close(&record_desc);
    }

