apemangr/Repetidor-nRF52-SDK-17.1.0/filesystem.c
    NRF_LOG_RAW_INFO(
               LOG_OK
               " --- FASE 1 COMPLETADA: %d registros validos encontrados "
               "---",
               history_valid_count);

    if (history_valid_count == 0) {
        NRF_LOG_RAW_INFO(LOG_INFO " No hay registros para enviar");
        return NRF_SUCCESS;
    }

    // FASE 2: Inicializar variables para envío asíncrono (usando array de
    // record keys)
    NRF_LOG_RAW_INFO(
               LOG_EXEC
               " --- FASE 2: Iniciando envio asincrono (usando record keys) "
               "---");

    history_send_active    = true;
    history_current_record = 0;
    history_total_records  = history_valid_count;
    history_sent_count     = 0;
    history_failed_count   = 0;

    NRF_LOG_RAW_INFO(
               LOG_EXEC " Enviando %d registros de forma asincrona...",
               history_total_records);

    // Enviar el primer lote de paquetes - los siguientes se enviarán en
    // BLE_NUS_EVT_TX_RDY
    history_send_next_packet();

    NRF_LOG_FLUSH();
    // Deleted delay function
    // nrf_delay_ms(1000);
    return NRF_SUCCESS;
}

// Funciones de estado para el envío de historial
bool history_send_is_active(void)
{
    return history_send_active;
}

uint32_t history_get_progress(void)
{
    if (history_total_records == 0)
        return 0;
    return (history_sent_count * 100) / history_total_records;
}

void delete_all_history(void)
{
    ret_code_t ret;

    ret = fds_file_delete(HISTORY_FILE_ID);

    if (ret != NRF_SUCCESS) {
        NRF_LOG_RAW_INFO(
                   LOG_WARN " No se pudieron eliminar todos "
                            "los "
                            "historiales: %d",
                   ret);
    }
    else {
        // Si se eliminaron exitosamente, resetear el contador
        config_repeater.cantidad_historiales = 0;
        
        // Guardar la configuración actualizada
        ret_code_t save_ret = save_config_to_flash(&config_repeater);
        if (save_ret == NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(LOG_OK " Contador de historiales reseteado a 0");
        }
        else {
            NRF_LOG_RAW_INFO(LOG_WARN " Error al guardar contador: 0x%X", save_ret);
        }
    }
    
    NRF_LOG_RAW_INFO(LOG_EXEC " Corriendo el recolector de basura...");

    ret = fds_gc();
    if (ret != NRF_SUCCESS) {
        NRF_LOG_RAW_INFO(
                   LOG_FAIL " Error al correr el recolector "
                            "de "
                            "basura: %d",
                   ret);
    }
}

ret_code_t delete_history_record_by_id(uint16_t record_id)
{
    ret_code_t        ret;
    fds_record_desc_t desc  = {0};
    fds_find_token_t  token = {0};

    // Calcular la clave del registro usando el offset del ID
    uint16_t record_key = HISTORY_RECORD_KEY_START + record_id;

    NRF_LOG_RAW_INFO(
               LOG_EXEC " --- Eliminando registro de historial ID: %u "
                        "---",
               record_id);
    NRF_LOG_RAW_INFO(LOG_EXEC " Buscando registro con KEY: 0x%04X", record_key);

    // Buscar el registro en la memoria flash
    ret = fds_record_find(HISTORY_FILE_ID, record_key, &desc, &token);

    if (ret == NRF_SUCCESS) {
        // El registro existe, proceder a eliminarlo
        ret = fds_record_delete(&desc);

        if (ret == NRF_SUCCESS) {
            // Ejecutar recolección de basura para liberar espacio
            nrf_delay_ms(100);
            ret_code_t gc_ret = fds_gc();
            if (gc_ret == NRF_SUCCESS) {
                NRF_LOG_RAW_INFO(LOG_OK " Recoleccion de basura completada");
            }
            else {
                NRF_LOG_RAW_INFO(
                           LOG_FAIL " Error en recoleccion de basura: "
                                    "0x%X",
                           gc_ret);
            }
        }
        else {
            NRF_LOG_RAW_INFO(
                       LOG_FAIL " Error al eliminar el registro ID %u: "
                                "0x%X",
                       record_id,
                       ret);
        }
    }
    else if (ret == FDS_ERR_NOT_FOUND) {
        NRF_LOG_RAW_INFO(
                   LOG_FAIL " Registro ID %u no encontrado, no se realizo "
                            "ninguna accion",
                   record_id);
        // No es un error, simplemente el registro no existe
        ret = NRF_SUCCESS;
    }
    else {
        NRF_LOG_RAW_INFO(
                   LOG_FAIL " Error al buscar el registro ID %u: "
                            "0x%X",
                   record_id,
                   ret);
    }

    return ret;
}

ret_code_t load_adc_values(adc_values_t *adc_values_cargados)
{
    ret_code_t        err_code;
    fds_record_desc_t desc  = {0};
    fds_find_token_t  token = {0};

    err_code                = fds_record_find(
               HISTORY_FILE_ID,
               HISTORY_ADC_VALUES_RECORD_KEY,
               &desc,
               &token);
    if (err_code == NRF_SUCCESS) {
        fds_flash_record_t flash_record = {0};
        err_code                        = fds_record_open(&desc, &flash_record);
        if (err_code != NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(
                       LOG_FAIL " No se pudo cargar desde FLASH los ADC "
                                "VALUES");
            return err_code;
        }

        memcpy(adc_values_cargados, flash_record.p_data, sizeof(adc_values_t));

        return fds_record_close(&desc);
    }

    return NRF_ERROR_NOT_FOUND;
}

ret_code_t save_adc_values(adc_values_t const *valores_a_guardar)
{
    ret_code_t        err_code;
    fds_record_desc_t desc_value = {0};
    fds_find_token_t  token      = {0};
    fds_record_t      record     = {
                        .file_id = HISTORY_FILE_ID,
                        .key     = HISTORY_ADC_VALUES_RECORD_KEY,
                        .data    = {.p_data       = valores_a_guardar,
                                    .length_words = (sizeof(adc_values_t) + 3) /
                                                    sizeof(uint32_t)}};

    if (valores_a_guardar->V1 >= 0 && valores_a_guardar->V1 <= 1023 && //
        valores_a_guardar->V2 >= 0 && valores_a_guardar->V2 <= 1023 && //
        valores_a_guardar->contador >= 1 &&
        valores_a_guardar->contador <= 65535) {
        adc_values.V1       = valores_a_guardar->V1;
        adc_values.V2       = valores_a_guardar->V2;
        adc_values.contador = valores_a_guardar->contador;
        NRF_LOG_RAW_INFO("\n\nLos valores de \"adc_values\" cargados son:\n");
        NRF_LOG_RAW_INFO(
                   "V1: %d\tV2: %d\tContador: %d\n",
                   adc_values.V1,
                   adc_values.V2,
                   adc_values.contador);
        NRF_LOG_FLUSH();
    }
    else {
        NRF_LOG_RAW_INFO("\n[ERROR] Valores de ADC_VALUES fuera de rango");
        return FDS_ERR_NOT_FOUND;
    }

    err_code = fds_record_find(
               HISTORY_FILE_ID,
               HISTORY_ADC_VALUES_RECORD_KEY,
               &desc_value,
               &token);
    if (err_code == NRF_SUCCESS) {
        err_code = fds_record_update(&desc_value, &record);
        if (err_code != NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(
                       "\n[ERROR] No se pudo actualizar el registro de "
                       "ADC_VALUES");
        }
    }
    else if (err_code == FDS_ERR_NOT_FOUND) {
        err_code = fds_record_write(NULL, &record);
        if (err_code == NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(
                       "\n[ERROR] No se pudo escribir el registro ADC_VALUES");
        }
    }
    else {
        NRF_LOG_RAW_INFO(
                   "\n[ERROR] No se encontro y no se pudo guardar el registro "
                   "ADV_VALUES");
    }
    return err_code;
}

//
//

void load_default_config(config_repeater_t *p_config)
{
    if (p_config == NULL)
        return;

    // MACs predeterminadas
    // MAC del emisor
    p_config->mac_emisor[5] = 0xFF;
    p_config->mac_emisor[4] = 0x00;
    p_config->mac_emisor[3] = 0x00;
    p_config->mac_emisor[2] = 0x00;
    p_config->mac_emisor[1] = 0xAB;
    p_config->mac_emisor[0] = 0xC1;

    // MAC del repetidor
    p_config->mac_repetidor[5] = 0x01;
    p_config->mac_repetidor[4] = 0x00;
    p_config->mac_repetidor[3] = 0x00;
    p_config->mac_repetidor[2] = 0x00;
    p_config->mac_repetidor[1] = 0xAB;
    p_config->mac_repetidor[0] = 0xC2;

    // Por defecto, usar MAC custom (comportamiento previo)
    p_config->enable_custom_mac_repetidor = true;

