apemangr/Repetidor-nRF52-SDK-17.1.0/filesystem.c
    // Tiempos predeterminados
    p_config->tiempo_encendido = DEFAULT_DEVICE_ON_TIME_MS;
    p_config->tiempo_dormido   = DEFAULT_DEVICE_SLEEP_TIME_MS;
    p_config->tiempo_extendido = DEFAULT_DEVICE_EXTENDED_ON_TIME_MS;

    // Version de firmware
    p_config->version[0] = 1;
    p_config->version[1] = 0;
    p_config->version[2] = 0;

    // Fecha y hora predeterminada de configuracion
    p_config->fecha.year   = 2024;
    p_config->fecha.month  = 1;
    p_config->fecha.day    = 1;
    p_config->fecha.hour   = 0;
    p_config->fecha.minute = 0;
    p_config->fecha.second = 0;

    // Cantidad de historiales guardados (inicialmente 0)
    p_config->cantidad_historiales = 0;

    NRF_LOG_RAW_INFO(LOG_INFO " Configuracion predeterminada cargada");
}


ret_code_t save_config_to_flash(config_repeater_t *p_config)
{
    if (p_config == NULL) {
        return NRF_ERROR_NULL;
    }

    // Actualizar la fecha de configuracion con el tiempo actual del RTC
    datetime_t current_time;
    if (calendar_get_time(&current_time)) {
        p_config->fecha = current_time;
    }
    else {
        NRF_LOG_RAW_INFO(LOG_WARN " No se pudo obtener tiempo actual del RTC");
    }

    fds_record_t      record;
    fds_record_desc_t record_desc;
    fds_find_token_t  ftok = {0};
    ret_code_t        ret;

    // Configura el registro
    record.file_id     = CONFIG_FILE_ID;
    record.key         = CONFIG_RECORD_KEY;
    record.data.p_data = p_config;
    record.data.length_words =
               (sizeof(config_repeater_t) + sizeof(uint32_t) - 1) /
               sizeof(uint32_t);

    // Buscar si ya existe el registro
    ret = fds_record_find(
               CONFIG_FILE_ID,
               CONFIG_RECORD_KEY,
               &record_desc,
               &ftok);

    if (ret == NRF_SUCCESS) {
        // Si existe, actualizar
        ret = fds_record_update(&record_desc, &record);
        if (ret == NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(
                       LOG_OK " Configuracion actualizada en memoria flash");
        }
        else {
            NRF_LOG_ERROR("Error al actualizar configuracion: 0x%X", ret);
        }
    }
    else if (ret == FDS_ERR_NOT_FOUND) {
        // Si no existe, crear nuevo registro
        ret = fds_record_write(&record_desc, &record);
        if (ret == NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(LOG_OK " Configuracion guardada en memoria flash");
        }
        else {
            NRF_LOG_RAW_INFO(
                       LOG_OK " Error al guardar configuracion: 0x%X",
                       ret);
        }
    }
    else {
        NRF_LOG_RAW_INFO(LOG_FAIL " Error al buscar configuracion: 0x%X", ret);
    }

    return ret;
}

ret_code_t load_config_from_flash(config_repeater_t *p_config)
{
    if (p_config == NULL) {
        return NRF_ERROR_NULL;
    }

    fds_record_desc_t  record_desc;
    fds_find_token_t   ftok = {0};
    fds_flash_record_t flash_record;
    ret_code_t         ret;

    // Buscar el registro de configuración
    ret = fds_record_find(
               CONFIG_FILE_ID,
               CONFIG_RECORD_KEY,
               &record_desc,
               &ftok);

    if (ret == NRF_SUCCESS) {
        // Abrir el registro
        ret = fds_record_open(&record_desc, &flash_record);
        if (ret == NRF_SUCCESS) {
            // Verificar tamaño
            uint32_t expected_words =
                       (sizeof(config_repeater_t) + sizeof(uint32_t) - 1) /
                       sizeof(uint32_t);
            if (flash_record.p_header->length_words >= expected_words) {
                // Copiar los datos
                memcpy(p_config,
                       flash_record.p_data,
                       sizeof(config_repeater_t));

                // Cerrar el registro
                fds_record_close(&record_desc);

                // Validar si la fecha es valida (diferente de cero)
                if (p_config->fecha.year == 0 || p_config->fecha.month == 0 ||
                    p_config->fecha.day == 0) {
                    NRF_LOG_RAW_INFO(
                               LOG_FAIL " Fecha de configuracion no valida - "
                                        "configuracion antigua");
                }

                return NRF_SUCCESS;
            }
            else {
                NRF_LOG_RAW_INFO(
                           LOG_FAIL
                           " Tamano de configuracion en flash no coincide");
                fds_record_close(&record_desc);
                return NRF_ERROR_INVALID_DATA;
            }
        }
        else {
            NRF_LOG_RAW_INFO(
                       LOG_FAIL " Error al abrir configuracion: 0x%X",
                       ret);
        }
    }
    else if (ret == FDS_ERR_NOT_FOUND) {
        NRF_LOG_RAW_INFO(
                   LOG_WARN
                   " Configuracion no encontrada en flash - usando valores "
                   "predeterminados");
        load_default_config(p_config);
        return NRF_SUCCESS;
    }
    else {
        NRF_LOG_RAW_INFO(LOG_FAIL " Error al buscar configuracion: 0x%X", ret);
    }

    return ret;
}


void set_custom_mac_repeater(void)
{
    ret_code_t err_code;
    ble_gap_addr_t gap_addr;

    // Si enable_custom_mac_repetidor es true, configurar MAC custom
    if (config_repeater.enable_custom_mac_repetidor)
    {
        // Obtener la dirección actual
        err_code = sd_ble_gap_addr_get(&gap_addr);
        if (err_code != NRF_SUCCESS)
        {
            NRF_LOG_RAW_INFO(LOG_FAIL " Error al obtener dirección actual: 0x%X", err_code);
            return;
        }

        // Configurar la nueva dirección con la MAC del repetidor
        // Los bytes deben estar en orden inverso para BLE (little-endian)
        gap_addr.addr[0] = config_repeater.mac_repetidor[5];
        gap_addr.addr[1] = config_repeater.mac_repetidor[4];
        gap_addr.addr[2] = config_repeater.mac_repetidor[3];
        gap_addr.addr[3] = config_repeater.mac_repetidor[2];
        gap_addr.addr[4] = config_repeater.mac_repetidor[1];
        gap_addr.addr[5] = config_repeater.mac_repetidor[0];
        
        gap_addr.addr_type = BLE_GAP_ADDR_TYPE_RANDOM_STATIC;

