apemangr/Repetidor-nRF52-SDK-17.1.0/filesystem.c
        // Establecer la nueva dirección
        err_code = sd_ble_gap_addr_set(&gap_addr);
        if (err_code != NRF_SUCCESS)
        {
            NRF_LOG_RAW_INFO(LOG_FAIL " Error al establecer MAC custom: 0x%X", err_code);
            return;
        }

        NRF_LOG_RAW_INFO("\n" LOG_OK " MAC custom del repetidor configurada: %02X:%02X:%02X:%02X:%02X:%02X",
                         config_repeater.mac_repetidor[0],
                         config_repeater.mac_repetidor[1],
                         config_repeater.mac_repetidor[2],
                         config_repeater.mac_repetidor[3],
                         config_repeater.mac_repetidor[4],
                         config_repeater.mac_repetidor[5]);
    }
    else
    {
        NRF_LOG_RAW_INFO(LOG_INFO " Usando MAC por defecto del dispositivo");
    }
}

void init_sistema_configuracion(config_repeater_t *p_config)
{
    ret_code_t ret;

    // Validar parametro de entrada
    if (p_config == NULL) {
        NRF_LOG_RAW_INFO(LOG_FAIL " Puntero de configuracion nulo");
        return;
    }

    // Flush inicial para limpiar buffer
    NRF_LOG_FLUSH();
    nrf_delay_ms(10);

    NRF_LOG_RAW_INFO("\n\n\033[1;36m==================\033[0m ");
    NRF_LOG_RAW_INFO("\033[1;33mCONFIGURACION CARGADA\033[0m");
    NRF_LOG_RAW_INFO(" \033[1;36m===================\033[0m\n");
    NRF_LOG_FLUSH();
    nrf_delay_ms(20);

    // Cargar configuracion desde flash
    ret = load_config_from_flash(p_config);

    if (ret == NRF_SUCCESS) {
        NRF_LOG_RAW_INFO(LOG_OK " Configuracion cargada desde flash\n\n");
    }
    else {
        NRF_LOG_RAW_INFO(LOG_INFO " Usando configuracion predeterminada\n\n");

        // Guardar configuracion predeterminada para futuras cargas
        ret_code_t save_ret = save_config_to_flash(p_config);
        if (save_ret == NRF_SUCCESS) {
            NRF_LOG_RAW_INFO(LOG_OK " Configuracion predeterminada guardada\n");
        }
    }
    NRF_LOG_FLUSH();
    nrf_delay_ms(20);

    // Mostrar MACs (una linea por MAC para respetar limite de argumentos)
    NRF_LOG_RAW_INFO(
               " - MAC Emisor    : %02X:%02X:%02X:",
               p_config->mac_emisor[0],
               p_config->mac_emisor[1],
               p_config->mac_emisor[2]);
    NRF_LOG_RAW_INFO(
               "%02X:%02X:%02X\n",
               p_config->mac_emisor[3],
               p_config->mac_emisor[4],
               p_config->mac_emisor[5]);
    NRF_LOG_FLUSH();
    nrf_delay_ms(15);

    NRF_LOG_RAW_INFO(
               " - MAC Repetidor : %02X:%02X:%02X:",
               p_config->mac_repetidor[0],
               p_config->mac_repetidor[1],
               p_config->mac_repetidor[2]);
    NRF_LOG_RAW_INFO(
               "%02X:%02X:%02X\n",
               p_config->mac_repetidor[3],
               p_config->mac_repetidor[4],
               p_config->mac_repetidor[5]);
    NRF_LOG_FLUSH();
    nrf_delay_ms(15);

    // Mostrar tiempos
    NRF_LOG_RAW_INFO(" - Tiempo Activo : %u ms\n", p_config->tiempo_encendido);
    NRF_LOG_RAW_INFO(" - Tiempo Sleep  : %u ms\n", p_config->tiempo_dormido);
    NRF_LOG_RAW_INFO(" - Tiempo Extend.: %u ms\n", p_config->tiempo_extendido);
    NRF_LOG_FLUSH();
    nrf_delay_ms(15);

    // Mostrar version
    NRF_LOG_RAW_INFO(
               " - Version FW    : v%u.%u.%u\n",
               p_config->version[0],
               p_config->version[1],
               p_config->version[2]);
    NRF_LOG_FLUSH();
    nrf_delay_ms(15);

    // Mostrar fecha de configuracion
    NRF_LOG_RAW_INFO(
               " - Fecha y hora  : %02u/%02u/%u ",
               p_config->fecha.day,
               p_config->fecha.month,
               p_config->fecha.year);
    NRF_LOG_RAW_INFO(
               "%02u:%02u:%02u\n",
               p_config->fecha.hour,
               p_config->fecha.minute,
               p_config->fecha.second);
    NRF_LOG_FLUSH();
    nrf_delay_ms(15);

    // Mostrar cantidad de historiales
    NRF_LOG_RAW_INFO(" - Historiales   : %u registros\n", p_config->cantidad_historiales);
    NRF_LOG_FLUSH();
    nrf_delay_ms(15);

    NRF_LOG_RAW_INFO(
               "\n\033[1;36m==================================================="
               "======="
               "==\033[0m");
    NRF_LOG_FLUSH();
    nrf_delay_ms(10);

    // Configurar la MAC del dispositivo según la configuración
    set_custom_mac_repeater();
}

ret_code_t send_config_via_ble(void)
{
    ret_code_t ret;

    // Crear buffer con identificadores + configuración
    uint16_t config_size = sizeof(config_repeater_t);
    uint16_t total_size =
               2 + config_size; // 2 bytes identificadores + configuración
    uint8_t *buffer = malloc(total_size);

    if (buffer == NULL) {
        NRF_LOG_RAW_INFO(
                   LOG_WARN " No se pudo reservar memoria para el buffer");
        return NRF_ERROR_NO_MEM;
    }

    // Agregar identificadores al inicio
    buffer[0] = 0xCC;
    buffer[1] = 0xAA;

    // Copiar la estructura de configuración después de los identificadores
    memcpy(&buffer[2], &config_repeater, config_size);

    // Enviar via BLE NUS
    ret = app_nus_server_send_data(buffer, total_size);

    if (ret == NRF_SUCCESS) {
        NRF_LOG_RAW_INFO(
                   LOG_OK " Configuracion enviada via BLE con identificadores "
                   "(%u "
                   "bytes total)",
                   total_size);

        // Mostrar los primeros bytes en log para debug
        NRF_LOG_RAW_INFO(LOG_INFO " Primeros bytes: ");
        for (int i = 0; i < (total_size > 16 ? 16 : total_size); i++) {
            NRF_LOG_RAW_INFO("%02X ", buffer[i]);
        }
        if (total_size > 16) {
            NRF_LOG_RAW_INFO("... (%u bytes total)", total_size);
        }
        NRF_LOG_RAW_INFO("\n");
    }
    else {
        NRF_LOG_RAW_INFO(
                   LOG_WARN " No se pudo enviar configuracion: 0x%X",
                   ret);
    }

    // Liberar memoria
    free(buffer);

    // También mostrar en log local para debug
    NRF_LOG_RAW_INFO("\n--- CONFIGURACION ACTUAL ---");
    NRF_LOG_RAW_INFO(
               "\nMAC Emisor: %02X:%02X:%02X:%02X:%02X:%02X",
               config_repeater.mac_emisor[5],
               config_repeater.mac_emisor[4],
               config_repeater.mac_emisor[3],
               config_repeater.mac_emisor[2],
               config_repeater.mac_emisor[1],
               config_repeater.mac_emisor[0]);
    NRF_LOG_RAW_INFO(
               "\nMAC Repetidor: %02X:%02X:%02X:%02X:%02X:%02X",
               config_repeater.mac_repetidor[5],
               config_repeater.mac_repetidor[4],
               config_repeater.mac_repetidor[3],
               config_repeater.mac_repetidor[2],
               config_repeater.mac_repetidor[1],
               config_repeater.mac_repetidor[0]);
    NRF_LOG_RAW_INFO(
               "\nMAC Custom Repetidor: %s",
               config_repeater.enable_custom_mac_repetidor ? "Habilitado" : "Deshabilitado");
    NRF_LOG_RAW_INFO(
               "\nTiempos: Activo=%ums, Sleep=%ums, Extendido=%ums",
               config_repeater.tiempo_encendido,
               config_repeater.tiempo_dormido,
               config_repeater.tiempo_extendido);
    NRF_LOG_RAW_INFO(
               "\nVersion: v%u.%u.%u",
               config_repeater.version[0],
               config_repeater.version[1],
               config_repeater.version[2]);
    NRF_LOG_RAW_INFO(
               "\nFecha Config: %02u/%02u/%u %02u:%02u:%02u",
               config_repeater.fecha.day,
               config_repeater.fecha.month,
               config_repeater.fecha.year,
               config_repeater.fecha.hour,
               config_repeater.fecha.minute,
               config_repeater.fecha.second);
    NRF_LOG_RAW_INFO(
               "\nCantidad Historiales: %u",
               config_repeater.cantidad_historiales);
    NRF_LOG_RAW_INFO("\n--- FIN CONFIGURACION ---\n");
    NRF_LOG_FLUSH();

    return ret;
}
